USE test;

DROP TABLE IF EXISTS test;

CREATE TABLE test(
`id` INT(11) NOT NULL AUTO_INCREMENT,
`name` VARCHAR(100) NOT NULL, 
`amount` INT(8) NOT NULL, 
`required` BIT(1) NOT NULL DEFAULT b'0',
PRIMARY KEY (`id`));

#25 entries
INSERT INTO `test`.`test` (`name`,`amount`,`required`) VALUES 
('процессор','8',1),
('материнская плата','20',1),
('звуковая карта','30',0),
('HDD диск','2',1),
('корпус','9',1),
('квантовый интерполятор хайзенберга','1',0),
('оперативная память','9',1),
('видеокарта','3',0),
('очень важная комплектующая','10',1),
('хорошая звуковая карта','1',0),
('клавиатура','6',1),
('еще более хорошая звуковая карта','5',0),
('SSD диск','7',0),
('USB разветлитель','99',0),
('сетевой фильтр','1',0),
('ИБП','10',0),
('генератор идей','1',0),
('кулер','6',1),
('блок питания','19',1),
('сетевая плата','7',0),
('клавиша "Esc"','112',0),
('Boar Vessel, 600-500 BC, Estruscan, ceramic','1',0),
('Optical Disk Drive','3',0),
('уникальная комплектующая №','20',0),
('Floppy FDD','1',0);